art/sm/haskell-his.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-19 Wed 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />

</head>
<body>
<div id="content">
<blockquote style = "font-size: 90%">
<p>
1987 年 9 月，在美国俄勒冈州波特兰的函数式编程语言与计算机架构大会上，召开了一场会议以讨论函数式语言社区的不幸处境：已经有了超过一打的非严格纯函数式语言，每一个都拥有相似的表达能力和基础语义。会上达成了一个强烈的共识，是因为一种共同语言的缺乏导致了这些语言的广泛使用。会议决定，应当组建一个委员会来设计这样一门语言，以提供一个快速交流新想法的工具，一个开发实际应用的稳定基础，以及一个鼓励他人使用函数式语言的媒介。这篇文档描述了这个委员会努力的成果：一门名叫 Haskell 的纯函数语言，以逻辑学家 Haskell B. Curry 命名，他的工作为我们的提供了逻辑基础。
</p>

<p>
委员会的主要目标是设计一门满足如下条件的语言：
</p>

<ol class="org-ol">
<li>它应当适合教学、研究和开发应用，包括构建大型的软件系统。</li>
<li>它应当完全由公布的形式化语法和语义所描述。</li>
<li>它应当可以免费获取。任何人都应当被允许实现这门语言，并分发给任何他希望的人。</li>
<li>它应当建立在具有广泛共识的想法之上。</li>
<li>它应当减少函数式语言社区中不必要的多样性。</li>
</ol>

<p>
委员会希望 Haskell 能够成为将来研究语言设计的基础。我们希望能够出现这门语言的扩展或者变种，以兼容实验性的特性。
</p>

</blockquote>
<p>
上面这段话，和一段来自 Haskell B. Curry 和 Robert Feys 的《组合子逻辑》的引用一起，贯穿了 Haskell Language Report 每一个版本的序言部分。
</p>

<p>
阅读本文的读者最好能够熟悉 Haskell 2010 标准。本文中所有的 “现在” 均指 Haskell 2010 标准。</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-19 Wed 14:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>